{
    "nyx_intro": [
        "Nyx (mockingly gentle): Awake, little godling. Does mortality feel as fragile as they say? A heartbeat, \na breath... so easily snuffed.",
        "Player (groggily): Where... am I? Who are you?",
        "Nyx (laughing softly): A guardian of shadows. A savior. Your savior. Ask the better question: Why are you \nhere?",
        "Player (clutching their head): I... don't remember. Why can't I remember...? What happened to me?",
        "Nyx (feigning pity): Oh, you poor mortal. How could he have done this to you...? Don't worry, I'll give \nyou the means for revenge.",
        "Player (angry): Can you stop speaking in riddles and tell me what is going on!",
        "Nyx (calm, pacing): You were just a child, so fueled with rage to gain power. Greedy. Bloodlusted. You \nscreamed for Ares' blessings, and he gave them—until you overreached. You thought yourself a god... \nuntil you fell.",
        "Nyx (dramatic): And oh, the blood price! A contract binding your soul to eternal servitude.",
        "Nyx (icy grip): But I saved you. Your soul is mine now.",
        "Player (pulling away): Let go! I don't feel dead... or bound!",
        "Nyx (smirking): Mortals never do. But you will. Unless you free yourself.",
        "Nyx (tosses sword): Take this blade. Sever your ties to Ares. Confront him on Olympus... and I will ensure \nyour freedom.",
        "Player (overwhelmed): Was I really that stupid? To make such a trade...",
        "Nyx (dismissive): Youth is folly. Now choose.",
        "Scene (background change): Three doorways appear.",
        "Nyx (gesturing to portals): - Blue: Stormy seas with a weathered ship. - Black/Purple: A misty river flowing \ninto a cavern. - Green: Sunlit plains with a grazing Pegasus.",
        "Nyx (to blue portal): Would you cross the stormy, unforgiving-yet peaceful and beautiful—waters of Greece on \na vessel marked with my gratitude?",
        "Nyx (to black/purple portal): Or brave the Underworld's domain via the River Styx? Sacrifice comfort for a \n*timely* arrival.",
        "Nyx (to green portal): Finally, traverse the vast, lush Plateaus of Greece astride the Pegasus Melanopter-marked \nwith my loyalty.",
        "Nyx (fading voice): Good luck, child. And don’t die."
    ],
    "instruction_screen": [
        "You are a demigod seeking revenge after Hades destroyed your family. To",
        "\nreach Olympus and confront him, you must collect 3 keys by mini-games",
        "\ncompleting quizzes that test your knowledge and wit. Along the way, play",
        "\nto earn power-ups that boost your strength, speed, and abilities in battle.",
        "\n\n",
        "Objective:",
        "\nCollect 3 keys to unlock the gates of Olympus and defeat Hades.",
        "\n\n",
        "How to Play:",
        "\n1. Complete Quizzes - Earn 1 key for every quiz you pass.",
        "\n2. Play Mini-Games - Win power-ups to aid you in your final battle.",
        "\n3. Enter Olympus - Once you have all 3 keys, face Hades in an epic showdown.",
        "\n\n",
        "Use your skills, think fast, and claim your destiny!"
    ]
}
